01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : KetilO
* Version            : V1.0.0
* Date               : 07/06/2012
* Description        : Main program body
********************************************************************************

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"

/* Private define ------------------------------------------------------------*/
#define ADC1_DR_Address           ((uint32_t)0x4001244C)
#define PC_IDR_Address            ((uint32_t)0x40011008)
#define STM32_DataSize            ((uint16_t)1024*7)
#define STM32_BlockSize           ((uint8_t)64)

/* STM32_Command */
#define STM32_CommandWait         ((uint8_t)0)
#define STM32_CommandInit         ((uint8_t)1)
#define STM32_CommandSampleStart  ((uint8_t)2)
#define STM32_CommandDone         ((uint8_t)99)

/* STM32_Modes */
#define STM32_ModeNone            ((uint8_t)0)
#define STM32_ModeScopeCHA        ((uint8_t)1)
#define STM32_ModeScopeCHB        ((uint8_t)2)
#define STM32_ModeScopeCHACHB     ((uint8_t)3)
#define STM32_ModeHSClockCHA      ((uint8_t)4)
#define STM32_ModeHSClockCHB      ((uint8_t)5)
#define STM32_ModeHSClockCHACHB   ((uint8_t)6)
#define STM32_ModeLGA             ((uint8_t)7)
#define STM32_ModeWriteData       ((uint8_t)8)
#define STM32_ModeReadData        ((uint8_t)9)

/* STM32_Triggers */
#define STM32_TriggerManual       ((uint8_t)0)
#define STM32_TriggerRisingCHA    ((uint8_t)1)
#define STM32_TriggerFallingCHA   ((uint8_t)2)
#define STM32_TriggerRisingCHB    ((uint8_t)3)
#define STM32_TriggerFallingCHB   ((uint8_t)4)
#define STM32_TriggerLGA          ((uint8_t)5)

/* Private typedef -----------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
__IO STM32_DataStructTypeDef STM32_DataStruct;        // 0x20000000

/* Private function prototypes -----------------------------------------------*/
void Clock_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void ADC_DVMConfig(void);
// void RCC_Configuration(void);
// void GPIO_Configuration(void);
// void NVIC_Configuration(void);
// void ADC_Startup(void);
// void ADC_Configuration(void);
// void DMA_ADC_Configuration(void);
// void DMA_LGA_Configuration(void);
// void TIM1_Configuration(void);
// void TIM2_Configuration(void);
// void TIM3_Configuration(void);
// void TIM4_Configuration(void);
// void TIM6_Configuration(void);
// void TIM7_Configuration(void);
// void TIM15_Configuration(void);
// void TIM16_Configuration(void);
// void TIM17_Configuration(void);
// void DAC_DDS_Configuration(void);
// void DDSWaveGenerator(void);
// void DDSSweepWaveGenerator(void);
// void DDSSweepWaveGeneratorPeak(void);
// void WaitForTrigger(void);
// void FAST_LGA_Read(void);
// void ADC_DVMConfiguration(void);

/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : main
* Description    : Main program
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main(void)
{
  u32 i;
  u32 *adr;

  Clock_Config();
  NVIC_Config();
  GPIO_Config();
  TIM_Config();
  ADC_DVMConfig();
  // /* System clocks configuration ---------------------------------------------*/
  // RCC_Configuration();
  // /* NVIC configuration ------------------------------------------------------*/
  // NVIC_Configuration();
  // /* GPIO configuration ------------------------------------------------------*/
  // GPIO_Configuration();
  // /* TIM1 configuration ------------------------------------------------------*/
  // TIM1_Configuration();
  // /* TIM2 configuration ------------------------------------------------------*/
  // TIM2_Configuration();
  // /* TIM3 configuration ------------------------------------------------------*/
  // TIM3_Configuration();
  // /* TIM4 configuration ------------------------------------------------------*/
  // TIM4_Configuration();
  // /* TIM6 configuration ------------------------------------------------------*/
  // TIM6_Configuration();
  // /* TIM7 configuration ------------------------------------------------------*/
  // TIM7_Configuration();
  // /* TIM15 configuration -----------------------------------------------------*/
  // TIM15_Configuration();
  // /* TIM16 configuration -----------------------------------------------------*/
  // TIM16_Configuration();
  // /* TIM17 configuration -----------------------------------------------------*/
  // TIM17_Configuration();
  // /* ADC1 sartup -------------------------------------------------------------*/
  // ADC_Startup();
  // /* ADC1 injected channels configuration ------------------------------------*/
  // ADC_DVMConfiguration();
  // /* Enable TIM1 */
  // TIM_Cmd(TIM1, ENABLE);
  // /* Enable TIM2 */
  // TIM_Cmd(TIM2, ENABLE);
  // /* Enable TIM3 */
  // TIM_Cmd(TIM3, ENABLE);
  // /* Enable TIM4 */
  // TIM_Cmd(TIM4, ENABLE);
  // /* Enable TIM2 Update interrupt */
  // TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
  // TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  // /* Enable TIM3 Update interrupt */
  // TIM_ClearITPendingBit(TIM3,TIM_IT_Update);
  // TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
  // /* Enable TIM4 Update interrupt */
  // TIM_ClearITPendingBit(TIM4,TIM_IT_Update);
  // TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);

  while (1)
  {
    if (STM32_DataStruct.CommandStruct.Command == STM32_CommandInit)
    {
      /* Reset STM32_CommandInit */
      STM32_DataStruct.CommandStruct.Command = STM32_CommandWait;
      // /* Turn on LED4 */
      // GPIO_SetBits(GPIOC,GPIO_Pin_8);
      // /* TIM1 disable counter */
      // TIM_Cmd(TIM1, DISABLE);
      // /* TIM1 reset count */
      // TIM1->CNT = (u16)0;
      // /* Set the TIM1 Capture Compare Register values */
      // TIM1->CCR1 = (u16)STM32_DataStruct.STM32_CommandStruct.ADC_TriggerValueCHA;
      // TIM1->CCR2 = (u16)STM32_DataStruct.STM32_CommandStruct.ADC_DCNullOutCHA;
      // TIM1->CCR3 =  (u16)STM32_DataStruct.STM32_CommandStruct.ADC_TriggerValueCHB;
      // TIM1->CCR4 =  (u16)STM32_DataStruct.STM32_CommandStruct.ADC_DCNullOutCHB;
      // /* TIM1 enable counter */
      // TIM_Cmd(TIM1, ENABLE);
      // switch (STM32_DataStruct.STM32_CommandStruct.STM32_Mode)
      // {
        // case STM32_ModeScopeCHA...STM32_ModeScopeCHACHB:
          // /* Set CHA and CHB Amplification levels */
          // GPIOB->ODR = (u16)(GPIOB->ODR & 0x03FF) | ((STM32_DataStruct.STM32_CommandStruct.ADC_AmplifyCHB << 13) | (STM32_DataStruct.STM32_CommandStruct.ADC_AmplifyCHA << 10));
          // /* DMA1 channel1 configuration -----------------------------------------*/
          // DMA_ADC_Configuration();
          // /* ADC1 configuration --------------------------------------------------*/
          // ADC_Configuration();
          // break;
        // case STM32_ModeWaveCHA...STM32_ModeWaveCHACHB:
          // break;
        // case STM32_ModeLGA:
          // /* TIM15 configuration ------------------------------------------------*/
          // TIM15_Configuration();
          // /* DMA1 channel5 configuration ----------------------------------------*/
          // DMA_LGA_Configuration();
          // break;
        // case STM32_ModeDDSWave:
          // ADC_DVMConfiguration();
          // DAC_DDS_Configuration();
          // switch ((u8) STM32_DataStruct.STM32_CommandStruct.SWEEP_SubMode)
          // {
            // case SWEEP_SubModeOff:
              // DDSWaveGenerator();
              // break;
            // case SWEEP_SubModeUp:
              // DDSSweepWaveGenerator();
              // break;
            // case SWEEP_SubModeDown:
              // DDSSweepWaveGenerator();
              // break;
            // case SWEEP_SubModeUpDown:
              // DDSSweepWaveGenerator();
              // break;
            // case SWEEP_SubModePeak:
              // DDSSweepWaveGeneratorPeak();
              // break;
          // }
          // break;
        // case STM32_ModeWriteByte:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // *adr = STM32_DataStruct.STM32_CommandStruct.dByte;
          // break;
        // case STM32_ModeWriteHalfWord:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // *adr = STM32_DataStruct.STM32_CommandStruct.dHalfWord;
          // break;
        // case STM32_ModeWriteWord:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // *adr = STM32_DataStruct.STM32_CommandStruct.dWord;
          // break;
        // case STM32_ModeReadByte:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // STM32_DataStruct.STM32_CommandStruct.dByte = *adr;
          // break;
        // case STM32_ModeReadHalfWord:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // STM32_DataStruct.STM32_CommandStruct.dHalfWord = *adr;
          // break;
        // case STM32_ModeReadWord:
          // adr = (u32 *)STM32_DataStruct.STM32_CommandStruct.Address;
          // STM32_DataStruct.STM32_CommandStruct.dWord = *adr;
          // break;
      // }
    }
    else if (STM32_DataStruct.CommandStruct.Command == STM32_CommandSampleStart)
    {
      // /* Turn off LED4 */
      // GPIO_ResetBits(GPIOC,GPIO_Pin_8);
      // /* Turn on LED3 */
      // GPIO_SetBits(GPIOC,GPIO_Pin_9);
      // switch (STM32_DataStruct.STM32_CommandStruct.STM32_Mode)
      // {
        // case STM32_ModeScopeCHA:
          // /* ADC1 regular channel 8 configuration */ 
          // /* Set sample time for channel 8 */
          // ADC1->SMPR2 = ((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 24);
          // /* Set rank 1 for channel 8 */
          // /* |00|Rank6|Rank5|Rank4|Rank3|Rank2|Rank1| */
          // /* |00|00000|00000|00000|00000|00000|01000| */
          // ADC1->SQR3 = (u32)0x00000008;
          // /* Enable ADC1 DMA */
          // ADC1->CR2 |=(u32)0x00000100;
          // /* Enable ADC1 */
          // ADC1->CR2 |= (u32)0x00000001;
          // WaitForTrigger();
          // /* Enable DMA1 channel1 */
          // DMA1_Channel1->CCR |= (u32)0x00000001;
          // /* Wait until DMA transfer complete */
          // while ((DMA1->ISR && DMA1_FLAG_TC1) == 0)
          // {
          // }
          // /* Disable DMA */
          // DMA_Cmd(DMA1_Channel1, DISABLE);
          // /* Disable ADC1 */
          // ADC_SoftwareStartConvCmd(ADC1, DISABLE);
          // break;
        // case STM32_ModeScopeCHB:
          // /* ADC1 regular channel 9 configuration */ 
          // /* Set sample time for channel 9 */
          // ADC1->SMPR2 = ((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 27);
          // /* Set rank 1 for channel 9 */
          // /* |00|Rank6|Rank5|Rank4|Rank3|Rank2|Rank1| */
          // /* |00|00000|00000|00000|00000|00000|01001| */
          // ADC1->SQR3 = (u32)0x00000009;
          // /* Enable ADC1 DMA */
          // ADC1->CR2 |=(u32)0x00000100;
          // /* Enable ADC1 */
          // ADC1->CR2 |= (u32)0x00000001;
          // WaitForTrigger();
          // /* Enable DMA1 channel1 */
          // DMA1_Channel1->CCR |= (u32)0x00000001;
          // /* Wait until DMA transfer complete */
          // while ((DMA1->ISR && DMA1_FLAG_TC1) == 0)
          // {
          // }
          // /* Disable DMA */
          // DMA_Cmd(DMA1_Channel1, DISABLE);
          // /* Disable ADC1 */
          // ADC_SoftwareStartConvCmd(ADC1, DISABLE);
          // break;
        // case STM32_ModeScopeCHACHB:
          // WaitForTrigger();
          // /* ADC1 regular channel 8 and channel 9 configuration */ 
          // /* Set sample time for channel 8 and channel 9 */
          // ADC1->SMPR2 = (((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 24) | ((u32)STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL << 27));
          // /* Set rank 2 for channel 8 and rank 1 for channel 9 */
          // /* |00|Rank6|Rank5|Rank4|Rank3|Rank2|Rank1| */
          // /* |00|00000|00000|00000|00000|01000|01001| */
          // ADC1->SQR3 = (u32)0x00000109;
          // /* Enable DMA1 channel1 */
          // DMA1_Channel1->CCR |= (u32)0x00000001;
          // /* Enable ADC1 DMA */
          // ADC1->CR2 |=(u32)0x00000100;
          // /* Enable ADC1 */
          // ADC1->CR2 |= (u32)0x00000001;
          /* Wait until DMA transfer complete */
          // while ((DMA1->ISR && DMA1_FLAG_TC1) == 0)
          // {
          // }
          // /* Disable DMA */
          // DMA_Cmd(DMA1_Channel1, DISABLE);
          // /* Disable ADC1 */
          // ADC_SoftwareStartConvCmd(ADC1, DISABLE);
          // break;
        // case STM32_ModeWaveCHA:
          // break;
        // case STM32_ModeWaveCHB:
          // break;
        // case STM32_ModeWaveCHACHB:
          // break;
        // case STM32_ModeLGA:
          // if ((STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateH << 8) + STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL == 0)
          // {
            // /* Wait for trigger */
            // WaitForTrigger();
            // FAST_LGA_Read();
          // }
          // else
          // {
            // /* Enable DMA1 channel5 */
            // DMA1_Channel5->CCR |= (u32)0x00000001;
            // /* Set TIM15 Counter */
            // TIM_SetCounter(TIM15,(u16)(STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateH << 8) + STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateL);
            // /* Wait for trigger */
            // WaitForTrigger();
            // /* Enable TIM15 */
            // TIM15->CR1 = (u16)0x0001;
            // /* Wait until DMA transfer complete */
            // while ((DMA1->ISR && DMA1_FLAG_TC5) == 0)
            // {
            // }
            // /* Disable DMA */
            // DMA_Cmd(DMA1_Channel5, DISABLE);
            // /* Disable TIM15 */
            // TIM_Cmd(TIM15, DISABLE);
          // }
          // break;
      // }
      // ADC_DVMConfiguration();
      /* Set sample ready to be read flag */
      STM32_DataStruct.CommandStruct.Command = STM32_CommandDone;
    }
    i=0;
    while (i < 1000000)
    {
      i++;
    }
    ADC_SoftwareStartInjectedConv(ADC1);
  }
}

