01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* Function Name  : TIM4_IRQHandler
* Description    : This function handles TIM4 global interrupt request.
*                  It increments the TIM4H 16 bit variable on each rollover
*                  of the counter.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void TIM4_IRQHandler(void)
// {
  // /* Clear TIM4 Update interrupt pending bit */
  // asm("mov    r2,#0x0");
  // asm("movw   r1,#0x0800");
  // asm("movt   r1,#0x4000");
  // asm("strh   r2,[r1,#0x10]");
  // /* Increment STM32_DataStruct.STM32_FRQDataStructCHB.TIMxH */
  // asm("mov    r1,#0x20000000");
  // asm("ldrh   r2,[r1,0x1e]");
  // asm("add    r2,r2,0x1");
  // asm("strh   r2,[r1,0x1e]");
// }

/*******************************************************************************
* Function Name  : ADC_Startup
* Description    : This function calibrates ADC1.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void ADC_Startup(void)
// {
  // ADC_InitTypeDef ADC_InitStructure;
  // /* ADCCLK = PCLK2/2 */
  // RCC_ADCCLKConfig(RCC_PCLK2_Div2);
  // /* ADC1 configuration ------------------------------------------------------*/
  // ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  // ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  // ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  // ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  // ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  // ADC_InitStructure.ADC_NbrOfChannel = 1;
  // ADC_Init(ADC1, &ADC_InitStructure);
  // /* ADC1 regular channel2 configuration */ 
  // ADC_RegularChannelConfig(ADC1, ADC_Channel_2, 1, ADC_SampleTime_55Cycles5);
  // /* Enable ADC1 */
  // ADC_Cmd(ADC1, ENABLE);
  // /* Enable ADC1 reset calibaration register */   
  // ADC_ResetCalibration(ADC1);
  // /* Check the end of ADC1 reset calibration register */
  // while(ADC_GetResetCalibrationStatus(ADC1));
  // /* Start ADC1 calibaration */
  // ADC_StartCalibration(ADC1);
  // /* Check the end of ADC1 calibration */
  // while(ADC_GetCalibrationStatus(ADC1));
// }

/*******************************************************************************
* Function Name  : ADC_DVNConfiguration
* Description    : This function prepares ADC1 for Injected conversion
*                  on channel 2 and channel 3.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void ADC_DVMConfiguration(void)
// {
  // ADC_InitTypeDef ADC_InitStructure;

  // /* ADCCLK = PCLK2/8 */
  // RCC_ADCCLKConfig(RCC_PCLK2_Div8);
  // ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  // ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  // ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  // ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  // ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  // /* ADC1 single channel configuration -----------------------------*/
  // ADC_InitStructure.ADC_NbrOfChannel = 1;
  // ADC_Init(ADC1, &ADC_InitStructure);

  // ADC_InjectedSequencerLengthConfig(ADC1,2);
  // ADC_InjectedChannelConfig(ADC1,ADC_Channel_2,1,ADC_SampleTime_239Cycles5);
  // ADC_InjectedChannelConfig(ADC1,ADC_Channel_3,2,ADC_SampleTime_239Cycles5);
  // ADC_AutoInjectedConvCmd(ADC1, ENABLE);
// }

/*******************************************************************************
* Function Name  : ADC_Configuration
* Description    : This function prepares ADC1
*                  for DMA transfer on channel 8 and / or channel 9.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void ADC_Configuration(void)
// {
  // ADC_InitTypeDef ADC_InitStructure;
  // ADC_AutoInjectedConvCmd(ADC1, DISABLE);
  // /* Setup ADC Clock divisor */
  // switch (STM32_DataStruct.STM32_CommandStruct.STM32_SampleRateH)
  // {
    // case (0):
      // /* ADCCLK = PCLK2/2 */
      // RCC_ADCCLKConfig(RCC_PCLK2_Div2);
      // break;
    // case (1):
      // /* ADCCLK = PCLK2/4 */
      // RCC_ADCCLKConfig(RCC_PCLK2_Div4);
      // break;
    // case (2):
      // /* ADCCLK = PCLK2/6 */
      // RCC_ADCCLKConfig(RCC_PCLK2_Div6);
      // break;
    // case (3):
      // /* ADCCLK = PCLK2/8 */
      // RCC_ADCCLKConfig(RCC_PCLK2_Div8);
      // break;
  // }
  // ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  // ADC_InitStructure.ADC_ScanConvMode = ENABLE;
  // ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;
  // ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  // ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Left;
  // switch (STM32_DataStruct.STM32_CommandStruct.STM32_Mode)
  // {
    // case STM32_ModeScopeCHA:
      // /* ADC1 single channel (CHA) configuration -----------------------------*/
      // ADC_InitStructure.ADC_NbrOfChannel = 1;
      // break;
    // case STM32_ModeScopeCHB:
      // /* ADC1 single channel (CHB) configuration -----------------------------*/
      // ADC_InitStructure.ADC_NbrOfChannel = 1;
      // break;
    // case STM32_ModeScopeCHACHB:
      // /* ADC1 dual channel configuration -------------------------------------*/
      // ADC_InitStructure.ADC_NbrOfChannel = 2;
      // break;
  // }
  // ADC_Init(ADC1, &ADC_InitStructure);
// }

/*******************************************************************************
* Function Name  : DMA_ADC_Configuration
* Description    : Configures the DMA1 channel 1 to transfer ADC data to memory.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void DMA_ADC_Configuration(void)
// {
  // DMA_InitTypeDef DMA_InitStructure;
  // DMA_DeInit(DMA1_Channel1);
  // DMA_DeInit(DMA1_Channel5);
  // DMA_InitStructure.DMA_PeripheralBaseAddr = ADC1_DR_Address+1;
  // DMA_InitStructure.DMA_MemoryBaseAddr = (u32)&STM32_DataStruct.STM32_Data;
  // DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  // DMA_InitStructure.DMA_BufferSize = (u32)(STM32_DataStruct.STM32_CommandStruct.STM32_DataBlocks * STM32_BlockSize * 2) - 2;
  // DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  // DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  // DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
  // DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  // DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  // DMA_InitStructure.DMA_Priority = DMA_Priority_High;
  // DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  // DMA_Init(DMA1_Channel1, &DMA_InitStructure);
  // /* Clear all interrupt pending bits */
  // DMA1->IFCR =0x0FFFFFFF;
// }

