01Hub/fbedit/STM32F4Discovery/STM32F4_Scope/Scope/main.c
/*******************************************************************************
* Function Name  : DMA_LGA_Configuration
* Description    : Configures the DMA1 channel 5 to transfer PC.00 to PC.07
*                  data to memory on each rollover of TIM15.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void DMA_LGA_Configuration(void)
// {
  // DMA_InitTypeDef DMA_InitStructure;
  // DMA_DeInit(DMA1_Channel1);
  // DMA_DeInit(DMA1_Channel5);
  // DMA_InitStructure.DMA_PeripheralBaseAddr = PC_IDR_Address;
  // DMA_InitStructure.DMA_MemoryBaseAddr = (u32)&STM32_DataStruct.STM32_Data;
  // DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
  // DMA_InitStructure.DMA_BufferSize = (u32)(STM32_DataStruct.STM32_CommandStruct.STM32_DataBlocks * STM32_BlockSize * 2) - 2;
  // DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  // DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  // DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
  // DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  // DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  // DMA_InitStructure.DMA_Priority = DMA_Priority_High;
  // DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  // DMA_Init(DMA1_Channel5, &DMA_InitStructure);
  // /* Clear all interrupt pending bits */
  // DMA1->IFCR =0x0FFFFFFF;
// }

/*******************************************************************************
* Function Name  : RCC_Configuration
* Description    : Configures the different system clocks.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void RCC_Configuration(void)
// {
  // /* RCC system reset(for debug purpose) */
  // RCC_DeInit();
  // /* Enable HSE */
  // RCC_HSEConfig(RCC_HSE_ON);
  // /* Wait till HSE is ready */
  // HSEStartUpStatus = RCC_WaitForHSEStartUp();
  // if(HSEStartUpStatus == SUCCESS)
  // {
    // /* Enable Prefetch Buffer */
    // FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable);
    // /* Flash 2 wait state */
    // FLASH_SetLatency(FLASH_Latency_0);
    // /* HCLK = SYSCLK */
    // RCC_HCLKConfig(RCC_SYSCLK_Div1); 
    // /* PCLK2 = HCLK */
    // RCC_PCLK2Config(RCC_HCLK_Div1); 
    // /* PCLK1 = HCLK */
    // RCC_PCLK1Config(RCC_HCLK_Div1);
    // /* ADCCLK = PCLK2/2 */
    // RCC_ADCCLKConfig(RCC_PCLK2_Div2);
// #ifdef STM32Clock24MHz
    // /* PLLCLK = 8MHz * 3 = 24 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_3);
// #endif
// #ifdef STM32Clock28MHz
    // /* PLLCLK = 8MHz / 2 * 7 = 28 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div2, RCC_PLLMul_7);
// #endif
// #ifdef STM32Clock32MHz
    // /* PLLCLK = 8MHz * 4 = 32 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_4);
// #endif
// #ifdef STM32Clock40MHz
    // /* PLLCLK = 8MHz * 5 = 40 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_5);
// #endif
// #ifdef STM32Clock48MHz
    // /* PLLCLK = 8MHz * 6 = 48 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_6);
// #endif
// #ifdef STM32Clock56MHz
    // /* PLLCLK = 8MHz * 7 = 56 MHz */
    // RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_7);
// #endif
    // /* Enable PLL */ 
    // RCC_PLLCmd(ENABLE);
    // /* Wait till PLL is ready */
    // while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
    // {
    // }
    // /* Select PLL as system clock source */
    // RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
    // /* Wait till PLL is used as system clock source */
    // while(RCC_GetSYSCLKSource() != 0x08)
    // {
    // }
  // }
  // /* Enable peripheral clocks ------------------------------------------------*/
  // /* Enable DMA1 clock */
  // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
  // /* Enable TIM1, ADC1, GPIOA, GPIOB and GPIOC clock */
  // RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM1 | RCC_APB2Periph_TIM15 | RCC_APB2Periph_TIM16 | RCC_APB2Periph_TIM17 | RCC_APB2Periph_ADC1 | RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC, ENABLE);
  // /* Enable DAC, TIM2, TIM3, TIM4, TIM6 and TIM7 clock */
  // RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC | RCC_APB1Periph_TIM2 | RCC_APB1Periph_TIM3 | RCC_APB1Periph_TIM4 | RCC_APB1Periph_TIM6 | RCC_APB1Periph_TIM7, ENABLE);
// }

/*******************************************************************************
* Function Name  : GPIO_Configuration
* Description    : Configures the different GPIO ports.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
// void GPIO_Configuration(void)
// {
  // GPIO_InitTypeDef GPIO_InitStructure;
  // /* Configure ADC Channel9 (PB.01) and ADC Channel8 (PB.00) as analog input */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1 | GPIO_Pin_0;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOB, &GPIO_InitStructure);
  // /* Configure DAC Channel1 (PA.04), DAC Channel2 (PA.05), ADC Channel2 (PA.02) and ADC Channel3 (PA.03) as analog input */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_6 | GPIO_Pin_5 | GPIO_Pin_4 | GPIO_Pin_3 | GPIO_Pin_2;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOA, &GPIO_InitStructure);
  // /* Configure PC.09 (LED3) and PC.08 (LED4) as output */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_8;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOC, &GPIO_InitStructure);
  // /* TIM2 channel 2 pin (PA.01) configuration */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOA, &GPIO_InitStructure);
  // /* TIM4 channel 2 pin (PB.07) configuration */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOB, &GPIO_InitStructure);
  // /* TIM16 Channel 1 pin (PB.08, TIM17 Channel 1 pin (PB.09) configuration */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_8;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOB, &GPIO_InitStructure);
  // /* TIM1 channel 1 pin (PA.08), channel 2 pin (PA.09), channel 3 pin (PA.10) and channel 4 pin (PA.11) configuration */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11 | GPIO_Pin_10 | GPIO_Pin_9 | GPIO_Pin_8;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOA, &GPIO_InitStructure);
  // /* LGA PC.07 to PC.00 configuration */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_6 | GPIO_Pin_5 | GPIO_Pin_4 | GPIO_Pin_3 | GPIO_Pin_2 | GPIO_Pin_1 | GPIO_Pin_0;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOC, &GPIO_InitStructure);
  // /* Scope CHA / CHB amplification selector (Open Drain Output) */
  // GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15 | GPIO_Pin_14 | GPIO_Pin_13 | GPIO_Pin_12 | GPIO_Pin_11 | GPIO_Pin_10;
  // GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  // GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  // GPIO_Init(GPIOB, &GPIO_InitStructure);
// }

